react-and-others.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-15 Mon 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>React 相关笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="梁子" />
<link rel="stylesheet" type="text/css" href="~/liangzid.github.io/notes/css/worg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">React 相关笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org270f4b1">1. 零碎知识</a>
<ul>
<li><a href="#org6018d63">1.1. 同步和异步</a></li>
<li><a href="#orgd048d86">1.2. feathers的设计哲学</a></li>
<li><a href="#orga905df0">1.3. react的设计哲学</a></li>
<li><a href="#org1b0c754">1.4. 前端设计存在的困难</a></li>
<li><a href="#org7d1f7c8">1.5. 后端的本质是什么？</a></li>
<li><a href="#org0245d74">1.6. 阅读别人代码时的一点体会</a></li>
</ul>
</li>
<li><a href="#org9191088">2. 算法与开发的关系，算法在系统中的地位</a></li>
<li><a href="#org955d911">3. render机制</a></li>
</ul>
</div>
</div>

<div id="outline-container-org270f4b1" class="outline-2">
<h2 id="org270f4b1"><span class="section-number-2">1</span> 零碎知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6018d63" class="outline-3">
<h3 id="org6018d63"><span class="section-number-3">1.1</span> 同步和异步</h3>
<div class="outline-text-3" id="text-1-1">
<p>
学习到async-await组合，简略了解了一下。
</p>

<ol class="org-ol">
<li>async是异步的意思。同步和异步的区别：同步——顺序执行，即主线程产生一个子线程，子线程执行完成后，主线程会继续执行。</li>
<li>异步：不是同步。即子线程可与主线程同时进行。因此，界面可以接受多个响应，而不是一一顺序回复。</li>
<li>回调函数：当异步的一个操作执行完成后需要在主线程进行的结果处理函数。</li>
<li>promise：代表了未来将要发生的事件，用来传递异步操作的消息。promise的状态：1）pending：未确定；2）fulfilled：成功；3）rejected：失败。</li>
<li>promise与event的不同：envent错过了就找不到了，promise的状态会被凝固住。</li>
<li>promise返回的结果：resolve：解析；reject，拒绝</li>
</ol>
</div>
</div>

<div id="outline-container-orgd048d86" class="outline-3">
<h3 id="orgd048d86"><span class="section-number-3">1.2</span> feathers的设计哲学</h3>
</div>

<div id="outline-container-orga905df0" class="outline-3">
<h3 id="orga905df0"><span class="section-number-3">1.3</span> react的设计哲学</h3>
</div>

<div id="outline-container-org1b0c754" class="outline-3">
<h3 id="org1b0c754"><span class="section-number-3">1.4</span> 前端设计存在的困难</h3>
</div>

<div id="outline-container-org7d1f7c8" class="outline-3">
<h3 id="org7d1f7c8"><span class="section-number-3">1.5</span> 后端的本质是什么？</h3>
<div class="outline-text-3" id="text-1-5">
<p>
后端的骨肉是“数据”，或数据库。后端的本质是：
</p>
<ol class="org-ol">
<li>设计一种方式将数据美妙地组织出来，也就是数据库；</li>
<li><p>
能够了解各种数据之间的关系，及对数据的操作；
</p>

<p>
所以，核心是要从这几个角度去理解后端。所以，看后端相关的代码，要理清楚有哪些数据库，他们分别对应哪些操作，之后才是，根据业务需求去设计相关的功能。
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org0245d74" class="outline-3">
<h3 id="org0245d74"><span class="section-number-3">1.6</span> 阅读别人代码时的一点体会</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>对于熟悉的事物，读代码比写代码更重要，因为这是在提升深度。</li>
<li>对于不熟悉的事物，读代码是一个开始。但必须要自己写，否则毫无意义。</li>
<li>如果是对一个新的领域开始学习的状态，如语言、框架、库全都是陌生的，那么读的时候应当注意：
<ul class="org-ul">
<li>不能烦躁。用心躁，则一事无成。</li>
<li>从入口开始读，一个项目，其文件组织结构大多是一棵树，从入口开始慢慢阅读就好了。</li>
<li>多搜索，以了解API的含义，或一些功能。</li>
<li>多写注释，至少每个单元，都必须有注释。</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9191088" class="outline-2">
<h2 id="org9191088"><span class="section-number-2">2</span> 算法与开发的关系，算法在系统中的地位</h2>
</div>

<div id="outline-container-org955d911" class="outline-2">
<h2 id="org955d911"><span class="section-number-2">3</span> render机制</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Mon Jun 28 22:15:57 2021</p>
<p class="author">Author: 梁子</p>
<p class="date">Created: 2021-11-15 Mon 20:45</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
